summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxPort_regdef.h
/** \\brief  Port Output Modification Set Register */
typedef struct _Ifx_P_OMSR_Bits
{
    unsigned int PS0:1;                     /**< \brief [0:0] Port n Set Bit x (w) */
    unsigned int PS1:1;                     /**< \brief [1:1] Port n Set Bit x (w) */
    unsigned int PS2:1;                     /**< \brief [2:2] Port n Set Bit x (w) */
    unsigned int PS3:1;                     /**< \brief [3:3] Port n Set Bit x (w) */
    unsigned int PS4:1;                     /**< \brief [4:4] Port n Set Bit x (w) */
    unsigned int PS5:1;                     /**< \brief [5:5] Port n Set Bit x (w) */
    unsigned int PS6:1;                     /**< \brief [6:6] Port n Set Bit x (w) */
    unsigned int PS7:1;                     /**< \brief [7:7] Port n Set Bit x (w) */
    unsigned int PS8:1;                     /**< \brief [8:8] Port n Set Bit x (w) */
    unsigned int PS9:1;                     /**< \brief [9:9] Port n Set Bit x (w) */
    unsigned int PS10:1;                    /**< \brief [10:10] Port n Set Bit x (w) */
    unsigned int PS11:1;                    /**< \brief [11:11] Port n Set Bit x (w) */
    unsigned int PS12:1;                    /**< \brief [12:12] Port n Set Bit x (w) */
    unsigned int PS13:1;                    /**< \brief [13:13] Port n Set Bit x (w) */
    unsigned int PS14:1;                    /**< \brief [14:14] Port n Set Bit x (w) */
    unsigned int PS15:1;                    /**< \brief [15:15] Port n Set Bit x (w) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_P_OMSR_Bits;

/** \\brief  Port Output Register */
typedef struct _Ifx_P_OUT_Bits
{
    unsigned int P0:1;                      /**< \brief [0:0]  (rwh) */
    unsigned int P1:1;                      /**< \brief [1:1]  (rwh) */
    unsigned int P2:1;                      /**< \brief [2:2]  (rwh) */
    unsigned int P3:1;                      /**< \brief [3:3]  (rwh) */
    unsigned int P4:1;                      /**< \brief [4:4]  (rwh) */
    unsigned int P5:1;                      /**< \brief [5:5]  (rwh) */
    unsigned int P6:1;                      /**< \brief [6:6]  (rwh) */
    unsigned int P7:1;                      /**< \brief [7:7]  (rwh) */
    unsigned int P8:1;                      /**< \brief [8:8]  (rwh) */
    unsigned int P9:1;                      /**< \brief [9:9]  (rwh) */
    unsigned int P10:1;                     /**< \brief [10:10]  (rwh) */
    unsigned int P11:1;                     /**< \brief [11:11]  (rwh) */
    unsigned int P12:1;                     /**< \brief [12:12]  (rwh) */
    unsigned int P13:1;                     /**< \brief [13:13]  (rwh) */
    unsigned int P14:1;                     /**< \brief [14:14]  (rwh) */
    unsigned int P15:1;                     /**< \brief [15:15]  (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_P_OUT_Bits;

/** \\brief  Port Pin Controller Select Register */
typedef struct _Ifx_P_PCSR_Bits
{
    unsigned int SEL0:1;                    /**< \brief [0:0] Pin Controller Select for Pin x (rw) */
    unsigned int SEL1:1;                    /**< \brief [1:1] Pin Controller Select for Pin x (rw) */
    unsigned int SEL2:1;                    /**< \brief [2:2] Pin Controller Select for Pin x (rw) */
    unsigned int SEL3:1;                    /**< \brief [3:3] Pin Controller Select for Pin x (rw) */
    unsigned int SEL4:1;                    /**< \brief [4:4] Pin Controller Select for Pin x (rw) */
    unsigned int SEL5:1;                    /**< \brief [5:5] Pin Controller Select for Pin x (rw) */
    unsigned int SEL6:1;                    /**< \brief [6:6] Pin Controller Select for Pin x (rw) */
    unsigned int SEL7:1;                    /**< \brief [7:7] Pin Controller Select for Pin x (rw) */
    unsigned int reserved_8:2;              /**< \brief \internal Reserved */
    unsigned int SEL10:1;                   /**< \brief [10:10] Pin Controller Select for Pin x (rw) */
    unsigned int SEL11:1;                   /**< \brief [11:11] Pin Controller Select for Pin x (rw) */
    unsigned int reserved_12:19;            /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_P_PCSR_Bits;

/** \\brief  Port Pin Function Decision Control Register */
typedef struct _Ifx_P_PDISC_Bits
{
    unsigned int PDIS0:1;                   /**< \brief [0:0] Pin Function Decision Control for Pin x (rw) */
    unsigned int PDIS1:1;                   /**< \brief [1:1] Pin Function Decision Control for Pin x (rw) */
    unsigned int PDIS2:1;                   /**< \brief [2:2] Pin Function Decision Control for Pin x (rw) */
    unsigned int PDIS3:1;                   /**< \brief [3:3] Pin Function Decision Control for Pin x (rw) */
    unsigned int PDIS4:1;                   /**< \brief [4:4] Pin Function Decision Control for Pin x (rw) */
    unsigned int PDIS5:1;                   /**< \brief [5:5] Pin Function Decision Control for Pin x (rw) */
    unsigned int PDIS6:1;                   /**< \brief [6:6] Pin Function Decision Control for Pin x (rw) */
    unsigned int PDIS7:1;                   /**< \brief [7:7] Pin Function Decision Control for Pin x (rw) */
    unsigned int PDIS8:1;                   /**< \brief [8:8] Pin Function Decision Control for Pin x (rw) */
    unsigned int PDIS9:1;                   /**< \brief [9:9] Pin Function Decision Control for Pin x (rw) */
    unsigned int PDIS10:1;                  /**< \brief [10:10] Pin Function Decision Control for Pin x (rw) */
    unsigned int PDIS11:1;                  /**< \brief [11:11] Pin Function Decision Control for Pin x (rw) */
    unsigned int PDIS12:1;                  /**< \brief [12:12] Pin Function Decision Control for Pin x (rw) */
    unsigned int PDIS13:1;                  /**< \brief [13:13] Pin Function Decision Control for Pin x (rw) */
    unsigned int PDIS14:1;                  /**< \brief [14:14] Pin Function Decision Control for Pin x (rw) */
    unsigned int PDIS15:1;                  /**< \brief [15:15] Pin Function Decision Control for Pin x (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_P_PDISC_Bits;

/** \\brief  Port Pad Driver Mode 0 Register */
typedef struct _Ifx_P_PDR0_Bits
{
    unsigned int PD0:3;                     /**< \brief [2:0]  (rw) */
    unsigned int PL0:1;                     /**< \brief [3:3]  (rw) */
    unsigned int PD1:3;                     /**< \brief [6:4]  (rw) */
    unsigned int PL1:1;                     /**< \brief [7:7]  (rw) */
    unsigned int PD2:3;                     /**< \brief [10:8]  (rw) */
    unsigned int PL2:1;                     /**< \brief [11:11]  (rw) */
    unsigned int PD3:3;                     /**< \brief [14:12]  (rw) */
    unsigned int PL3:1;                     /**< \brief [15:15]  (rw) */
    unsigned int PD4:3;                     /**< \brief [18:16]  (rw) */
    unsigned int PL4:1;                     /**< \brief [19:19]  (rw) */
    unsigned int PD5:3;                     /**< \brief [22:20]  (rw) */
    unsigned int PL5:1;                     /**< \brief [23:23]  (rw) */
    unsigned int PD6:3;                     /**< \brief [26:24]  (rw) */
    unsigned int PL6:1;                     /**< \brief [27:27]  (rw) */
    unsigned int PD7:3;                     /**< \brief [30:28]  (rw) */
    unsigned int PL7:1;                     /**< \brief [31:31]  (rw) */
} Ifx_P_PDR0_Bits;

